{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "A01---International Coastal Atlas Network Coastal Erosion Global Thesaurus---International Coastal Atlas Network\n",
      "A02---Oregon Coastal Atlas Coastal Erosion Thesaurus markup terms---Oregon State Coastal Management Program\n",
      "A03---Oregon Coastal Atlas Coastal Erosion Thesaurus discovery terms---Oregon State Coastal Management Program\n",
      "A04---MIDA Coastal Erosion Thesaurus---Coastal and Marine resources Centre\n",
      "A05---AtlantOS Essential Variables---British Oceanographic Data Centre\n",
      "B02---BODC-annotated certified reference materials---British Oceanographic Data Centre\n",
      "B03---BODC-annotated reference material classifiers---British Oceanographic Data Centre\n",
      "B04---BODC people titles---British Oceanographic Data Centre\n",
      "B05---BODC governance roles---British Oceanographic Data Centre\n",
      "B06---BODC data and metadata integrity checks---British Oceanographic Data Centre\n",
      "B07---Sampling net gear deployment vocabulary---British Oceanographic Data Centre\n",
      "B09---Celtic Seas Partnership data owner nations bordering MSFD Celtic Seas Marine Region---British Oceanographic Data Centre\n",
      "B11---BODC Standard Operating Procedures and Protocols for environmental observations---British Oceanographic Data Centre\n",
      "B12---BODC measurement numeric attribute types---British Oceanographic Data Centre\n",
      "B20---Celtic Seas Partnership stakeholder sectors---British Oceanographic Data Centre\n",
      "B21---Celtic Seas Partnership scale---British Oceanographic Data Centre\n",
      "B22---Celtic Seas Partnership governance mechanisms---British Oceanographic Data Centre\n",
      "B39---NMF-SS Research Vessel underway variable NetCDF vocabulary---British Oceanographic Data Centre\n",
      "B75---BODC Organisations---British Oceanographic Data Centre\n",
      "B76---BODC Platform Models---British Oceanographic Data Centre\n",
      "C00---BODC Seafloor Depth Data Sources---British Oceanographic Data Centre\n",
      "C10---BODC series feature types---British Oceanographic Data Centre\n",
      "C16---SeaDataNet sea areas---SeaDataNet\n",
      "C17---ICES Platform Codes---International Council for the Exploration of the Sea\n",
      "C18---Intergovernmental Oceanographic Commission countries---International Council for the Exploration of the Sea\n",
      "C19---SeaVoX salt and fresh water body gazetteer---SeaDataNet and MarineXML Vocabulary Content Governance Group\n",
      "C30---Active vocabulary content governance authorities---British Oceanographic Data Centre\n",
      "C31---World Meteorological Organisation voluntary observing ship category---World Meteorological Organisation\n",
      "C32---International Standards Organisation countries---International Organization for Standardization\n",
      "C33---NERC DataGrid data production tool category---Natural Environment Research Council\n",
      "C34---Activity purpose categories---SeaDataNet\n",
      "C35---European Nature Information System Level 3 Habitats---European Environment Agency\n",
      "C36---Monitoring activity legislative drivers---SeaDataNet\n",
      "C37---Ten-degree Marsden Squares---SeaDataNet\n",
      "C38---SeaDataNet Ports Gazetteer---SeaDataNet\n",
      "C39---World Meteorological Organisation sea states---World Meteorological Organisation\n",
      "C40---Bonn Agreement pollution report accuracy---Bonn Agreement\n",
      "C41---BODC marine pollution sources---British Oceanographic Data Centre\n",
      "C43---BODC oilspill quantity---British Oceanographic Data Centre\n",
      "C45---Marine Strategy Framework Directive descriptors 2010/477/EU---European Commission\n",
      "C46---Marine Strategy Framework Directive criteria 2010/477/EU---European Commission\n",
      "C47---Marine Strategy Framework Directive indicators 2010/477/EU---European Commission\n",
      "C48---MEDIN Data Guidelines---MEDIN Standards Group\n",
      "C59---BODC organisation roles within activities and projects---British Oceanographic Data Centre\n",
      "C60---NERC DataGrid vocabulary term relationships---British Oceanographic Data Centre\n",
      "C61---BODC post town names---British Oceanographic Data Centre\n",
      "C62---BODC administrative region names---British Oceanographic Data Centre\n",
      "C64---United Kingdom Charting Progress 2 sea regions---MEDIN Standards Group\n",
      "C67---BODC series parameter collection names---British Oceanographic Data Centre\n",
      "C71---BODC organisation categories---British Oceanographic Data Centre\n"
     ]
    }
   ],
   "source": [
    "#Get the list of vocabularies included in NVS\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://vocab.nerc.ac.uk/sparql/sparql\") #Choose the sparql endpoint you wish\n",
    "sparql.setQuery(\"\"\"\n",
    "\n",
    "prefix skos:<http://www.w3.org/2004/02/skos/core#>\n",
    "prefix owl:<http://www.w3.org/2002/07/owl#>\n",
    "prefix dc:<http://purl.org/dc/terms/>\n",
    "\n",
    "select distinct (?localnam as ?Collection) (?dt as ?Title) (?desc as ?Description) (?crex as ?Governance)  \n",
    "where {\n",
    "?x a skos:Collection .\n",
    "optional{?x dc:creator ?cre } .\n",
    "?x dc:title ?dt ;dc:description ?desc .BIND(REPLACE(str(?x), \"http://vocab.nerc.ac.uk/collection/\", \"\") AS ?localname) BIND(REPLACE(str(?localname), \"/current/\", \"\") AS ?localnam) BIND(if(EXISTS{?x dc:creator ?cre},?cre,\"\") as ?crex)}  \n",
    "order by desc(?Rank) \n",
    "offset 0 limit 50\n",
    "\n",
    "\"\"\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"Collection\"][\"value\"],result[\"Title\"][\"value\"],result[\"Governance\"][\"value\"],sep=\"---\")\n",
    " \n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://vocab.nerc.ac.uk/collection/P01/current/NEUTDENS/---Density (neutral) of the water body\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/TCNTTCHO/---Raw signal (counts) of instrument output by thermosalinograph conductivity cell temperature sensor\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SALINACC/---Accuracy of salinity in the water body\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SVELCT01/---Sound velocity in the water body by CTD and computation from temperature and salinity by unspecified algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/TOKGPR01/---Conversion factor (volume to mass) for the water body by CTD and computation of density (in-situ potential temperature surface pressure) reciprocal from pressure, temperature and salinity\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SCOXGCXX/---Saturation of carbon monoxide {CO CAS 630-08-0} in the water body [dissolved plus reactive particulate phase] by computation from concentration\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/TOKGPR02/---Conversion factor (volume to mass) for the water body by CTD (second sensor) and computation of density (in-situ potential temperature surface pressure) reciprocal from pressure, temperature and salinity\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/ISMA1501/---Concentration (at saturation at atmospheric pressure) of nitrogen {N2} in the water body by computation from salinity and temperature\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/TCNTCCHO/---Raw signal (counts) of instrument output by thermosalinograph conductivity sensor\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SVELSG01/---Sound velocity in the water body by thermosalinograph and computation from temperature and salinity by unspecified algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SVELMV01/---Sound velocity in the water body by moving vessel profiler (MVP) and computation from temperature and salinity by unspecified algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SSALAGT1/---Salinity of the water body by titration against silver nitrate (AgNO3)\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SSALSL01/---Salinity of the water body by STD\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/ODSDM021/---Salinity of the water body\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALCU01/---Practical salinity of the water body by CTD and computation using UNESCO 1983 algorithm and NO calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALCC01/---Practical salinity of the water body by CTD and computation using UNESCO 1983 algorithm and calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALCC02/---Practical salinity of the water body by CTD (second sensor) and computation using UNESCO 1983 algorithm and calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/ASLTZZ01/---Absolute salinity of the water body\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/DOXYMMOP/---Concentration recalculated to zero salinity of oxygen {O2 CAS 7782-44-7} per unit volume of the water body [dissolved plus reactive particulate phase]\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALEXTX/---Practical salinity of experiment water sample by bench salinometer and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SSAMP001/---Sampling salinity\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SIGTPR01/---Sigma-theta of the water body by CTD and computation from salinity and potential temperature using UNESCO algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/POTDENS0/---Density (potential) of the water body by computation from salinity and potential temperature using UNESCO algorithm with 0 decibar reference pressure\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/TOKGSG01/---Conversion factor (volume to mass) for the water body by thermosalinograph and computation of density reciprocal from pressure, temperature and salinity\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/POTDENS1/---Density (potential) of the water body by computation from salinity and potential temperature using UNESCO algorithm with 1000 decibar reference pressure\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/POTDENS2/---Density (potential) of the water body by computation from salinity and potential temperature using UNESCO algorithm with 2000 decibar reference pressure\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/POTDENS3/---Density (potential) of the water body by computation from salinity and potential temperature using UNESCO algorithm with 3000 decibar reference pressure\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/POTMS601/---Potential temperature of the water body by CTD and computation from pressure, salinity and IPTS-68 temperature using UNESCO algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SVELCV01/---Sound velocity in the water body by computation from temperature and salinity by unspecified algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/POTDENS4/---Density (potential) of the water body by computation from salinity and potential temperature using UNESCO algorithm with 4000 decibar reference pressure\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SIGTEQST/---Sigma-T of the water body by computation from salinity and temperature using UNESCO algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SIGTPR02/---Sigma-theta of the water body by CTD (second sensor) and computation from salinity and potential temperature using UNESCO algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SIGTSG01/---Sigma-theta of the water body by thermosalinograph and computation from salinity and potential temperature using UNESCO algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSSDEXTX/---Practical salinity standard deviation of experiment water sample by bench salinometer\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SIGTMV01/---Sigma-theta of the water body by moving vessel profiler (MVP) and computation from salinity and potential temperature using UNESCO algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SIGTEQ01/---Sigma-theta of the water body by computation from salinity and potential temperature using UNESCO algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SSALBSTX/---Salinity of the water body by bench salinometer\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSCLCCL1/---Practical salinity of the water body by in-situ conductivity cell and computation using UNESCO 1983 algorithm and laboratory calibrations applied\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALTC01/---Practical salinity of the water body by in-situ conductivity cell and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALBRBR/---Practical salinity of the water body by RBR MS-310 micro-salinometer and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALSD01/---Practical salinity standard deviation of the water body by CTD and computation using UNESCO 1983 algorithm and calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALTC02/---Practical salinity of the water body by in-situ conductivity cell (second sensor) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSCLCCI1/---Practical salinity of the water body by in-situ conductivity cell and computation using UNESCO 1983 algorithm and calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSSDBSTX/---Practical salinity standard deviation of the water body by bench salinometer\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALTC03/---Practical salinity of the water body by in-situ conductivity cell (third sensor) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSSDCU01/---Practical salinity standard deviation of the water body by CTD and computation using UNESCO 1983 algorithm and NO calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALBSTX/---Practical salinity of the water body by bench salinometer and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALST01/---Practical salinity of the water body by CTD and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALTC04/---Practical salinity of the water body by in-situ conductivity cell (fourth sensor) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSSDCU02/---Practical salinity standard deviation of the water body by CTD (second sensor) and computation using UNESCO 1983 algorithm and NO calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALST02/---Practical salinity of the water body by CTD (second sensor) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALCU02/---Practical salinity of the water body by CTD (second sensor) and computation using UNESCO 1983 algorithm and NO calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALTC05/---Practical salinity of the water body by in-situ conductivity cell (fifth sensor) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALTC06/---Practical salinity of the water body by in-situ conductivity cell (sixth sensor) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SSALST01/---Salinity of the water body by CTD\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALPR01/---Practical salinity of the water body by conductivity cell and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSLTZZ01/---Practical salinity of the water body\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALSG01/---Practical salinity of the water body by thermosalinograph and computation using UNESCO 1983 algorithm and calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALPR02/---Practical salinity of the water body by conductivity cell (second sensor) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALMC01/---Practical salinity of the water body by moving vessel profiler (MVP) and computation using UNESCO 1983 algorithm and calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALSG02/---Practical salinity of the water body by thermosalinograph (second sensor) and computation using UNESCO 1983 algorithm and calibration against independent measurements\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALSZ01/---Practical salinity of the water body by thermosalinograph and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALZZXX/---Practical salinity of the water body by computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SSALPR01/---Salinity of the water body by conductivity cell\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALMV01/---Practical salinity of the water body by moving vessel profiler (MVP) and computation using UNESCO 1983 algorithm\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/SSALSG01/---Salinity of the water body by thermosalinograph\n",
      "http://vocab.nerc.ac.uk/collection/P01/current/PSALSU01/---Practical salinity of the water body by thermosalinograph and computation using UNESCO 1983 algorithm and NO calibration against independent measurements\n"
     ]
    }
   ],
   "source": [
    "#Search for \"salinity\" parameters in P01 vocabulary, using indexing\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://vocab.nerc.ac.uk/sparql/sparql\") #Choose the sparql endpoint you wish\n",
    "sparql.setQuery(\"\"\"\n",
    "prefix skos:<http://www.w3.org/2004/02/skos/core#>\n",
    "prefix text:<http://jena.apache.org/text#>\n",
    "prefix rdf:<http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "prefix owl:<http://www.w3.org/2002/07/owl#> \n",
    "prefix dc:<http://purl.org/dc/terms/>\n",
    "\n",
    "select distinct (?x as ?URL) (?pl as ?PrefLabel) \n",
    "\n",
    "where {?x text:query ('*salinity*' 100000). \n",
    "<http://vocab.nerc.ac.uk/collection/P01/current/> skos:member ?x. \n",
    "?x owl:deprecated \"false\" . ?x skos:prefLabel ?pl . \n",
    "FILTER(langMatches(lang(?pl), \"en\")) \n",
    "?x dc:identifier ?dci . \n",
    " \n",
    " }  \n",
    "\"\"\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"URL\"][\"value\"],result[\"PrefLabel\"][\"value\"],sep=\"---\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.w3.org/2004/02/skos/core#Concept\n",
      "http://www.w3.org/2004/02/skos/core#ConceptScheme\n",
      "http://www.w3.org/2004/02/skos/core#Collection\n",
      "http://www.w3.org/1999/02/22-rdf-syntax-ns#Statement\n"
     ]
    }
   ],
   "source": [
    "#Easy query to list the structure (equivalent to DESC in oracle) of a triple store\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://vocab.nerc.ac.uk/sparql/sparql\") #Choose the sparql endpoint you wish\n",
    "sparql.setQuery(\"\"\"\n",
    "select distinct ?a where {[] a ?a.} \n",
    "\"\"\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"a\"][\"value\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SDN:L06::64---geostationary orbiting satellite\n",
      "SDN:L06::31---research vessel\n",
      "SDN:L06::48---mooring\n",
      "SDN:L06::65---orbiting satellite\n",
      "SDN:L06::67---helicopter\n",
      "SDN:L06::62---aeroplane\n",
      "SDN:L06::71---human\n",
      "SDN:L06::46---drifting subsurface profiling float\n",
      "SDN:L06::77---land-sea mammals\n",
      "SDN:L06::25---autonomous underwater vehicle\n",
      "SDN:L06::47---float\n",
      "SDN:L06::14---land/onshore structure\n",
      "SDN:L06::10---land or seafloor\n",
      "SDN:L06::41---moored surface buoy\n",
      "SDN:L06::45---fixed subsurface vertical profiler\n",
      "SDN:L06::43---subsurface mooring\n",
      "SDN:L06::11---fixed benthic node\n",
      "SDN:L06::16---offshore structure\n",
      "SDN:L06::75---cetacean\n",
      "SDN:L06::42---drifting surface float\n",
      "SDN:L06::6Z---spacecraft\n",
      "SDN:L06::21---propelled manned submersible\n",
      "SDN:L06::20---submersible\n",
      "SDN:L06::3B---autonomous surface water vehicle\n",
      "SDN:L06::17---coastal structure\n",
      "SDN:L06::9B---hovercraft\n",
      "SDN:L06::23---towed unmanned submersible\n",
      "SDN:L06::0---unknown\n",
      "SDN:L06::12---sea bed vehicle\n",
      "SDN:L06::53---tethered balloon\n",
      "SDN:L06::19---mesocosm bag\n",
      "SDN:L06::96---amphibious crawler\n",
      "SDN:L06::39---naval vessel\n",
      "SDN:L06::34---vessel at fixed position\n",
      "SDN:L06::95---amphibious vehicle\n",
      "SDN:L06::74---seabird and duck\n",
      "SDN:L06::33---self-propelled small boat\n",
      "SDN:L06::68---satellite\n",
      "SDN:L06::73---flightless bird\n",
      "SDN:L06::76---fish\n",
      "SDN:L06::44---drifting subsurface float\n",
      "SDN:L06::91---ice island\n",
      "SDN:L06::6A---glider\n",
      "SDN:L06::22---propelled unmanned submersible\n",
      "SDN:L06::51---free-rising balloon\n",
      "SDN:L06::24---drifting manned submersible\n",
      "SDN:L06::54---airship\n",
      "SDN:L06::13---beach/intertidal zone structure\n",
      "SDN:L06::60---non-buoyant aircraft\n",
      "SDN:L06::32---vessel of opportunity\n",
      "SDN:L06::63---rocket\n",
      "SDN:L06::92---ice shelf\n",
      "SDN:L06::15---land/onshore vehicle\n",
      "SDN:L06::35---vessel of opportunity on fixed route\n",
      "SDN:L06::70---organism\n",
      "SDN:L06::9A---DUKW\n",
      "SDN:L06::37---self-propelled boat\n",
      "SDN:L06::3Z---surface vessel\n",
      "SDN:L06::72---diver\n",
      "SDN:L06::6C---parachute\n",
      "SDN:L06::6B---kite\n",
      "SDN:L06::90---cryosphere\n",
      "SDN:L06::3A---man-powered small boat\n",
      "SDN:L06::26---lowered unmanned submersible\n",
      "SDN:L06::52---free-floating balloon\n",
      "SDN:L06::66---manned spacecraft\n",
      "SDN:L06::61---research aeroplane\n",
      "SDN:L06::30---ship\n",
      "SDN:L06::69---autogyro\n",
      "SDN:L06::18---river station\n",
      "SDN:L06::50---buoyant aircraft\n",
      "SDN:L06::38---man-powered boat\n",
      "SDN:L06::36---fishing vessel\n",
      "SDN:L06::27---sub-surface gliders\n",
      "SDN:L06::3C---surface gliders\n",
      "SDN:L06::3D---drillship\n",
      "SDN:L06::93---pack ice\n",
      "SDN:L06::94---drift ice\n",
      "SDN:L06::49---surface ice buoy\n",
      "SDN:L06::6D---unmanned aerial vehicle\n"
     ]
    }
   ],
   "source": [
    "#Get the list of terms of a certain vocabulary: here is L05\n",
    "#Change L05 to L06 or P08 or the vocabulary you want to get\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://vocab.nerc.ac.uk/sparql/sparql\")\n",
    "sparql.setQuery(\"\"\"\n",
    "prefix skos:<http://www.w3.org/2004/02/skos/core#> \n",
    "prefix rdf:<http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "prefix owl:<http://www.w3.org/2002/07/owl#> \n",
    "prefix dc:<http://purl.org/dc/terms/> \n",
    "select distinct \n",
    "(?dci as ?identifier) (?pl as ?PrefLabel) \n",
    "\n",
    "where {<http://vocab.nerc.ac.uk/collection/L06/current/>  skos:member ?dt . \n",
    "?dt dc:identifier ?dci . optional{?dt skos:definition ?def . \n",
    "FILTER(langMatches(lang(?def), \"en\"))} . ?dt skos:prefLabel ?pl ; \n",
    "FILTER(langMatches(lang(?pl), \"en\")) optional{?dt owl:versionInfo ?ver } . \n",
    "?dt dc:date ?Date ; owl:deprecated ?deprecated . optional {?dt skos:altLabel ?alt }. \n",
    "FILTER( ((str(?deprecated)=\"false\")) )BIND(if(bound(?def),?def,\"\") as ?defx) } \n",
    "\"\"\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"identifier\"][\"value\"],result[\"PrefLabel\"][\"value\"],sep=\"---\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
